

&НаКлиенте
Процедура ИзменитьПароль(Команда)
	Если НовыйПароль = ПовторитеПароль Тогда
		#Если (ТонкийКлиент) Тогда
			Если Вопрос("Меняем пароль?", РежимДиалогаВопрос.ДаНет, , , "Меняем пароль?", ) = КодВозвратаДиалога.Да Тогда
				ИзменитьПарольНаСервере();
			КонецЕсли;
		#Иначе
			ИзменитьПарольНаСервере();
		#КонецЕсли
	Иначе
		Сообщить("Пароли не совпадают!!!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ИзменитьПарольНаСервере()
	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	ТекущийПользователь.Пароль = НовыйПароль;
	ТекущийПользователь.Записать();
КонецПроцедуры
