
Процедура ПередЗаписью(Отказ)
	ТекущийПользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	Если НЕ ТекущийПользователь <> Неопределено Тогда
		НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		НовыйПользователь.Имя = Наименование;
		НовыйПользователь.Пароль = "12345678";
		СтруктураОтбора = Новый Структура("Включена", Истина);
		ПраваПользователя = ПраваДоступа.НайтиСтроки(СтруктураОтбора);
		Для каждого Роль Из ПраваПользователя Цикл
			ВыбраннаяРоль = Метаданные.Роли.Найти(Роль.ИмяРоли);
			НовыйПользователь.Роли.Добавить(ВыбраннаяРоль);
		КонецЦикла;
		НовыйПользователь.Записать();
	Иначе 
		ТекущийПользователь.Роли.Очистить();
		СтруктураОтбора = Новый Структура("Включена", Истина);
		ПраваПользователя = ПраваДоступа.НайтиСтроки(СтруктураОтбора);
		Для каждого Роль Из ПраваПользователя Цикл
			ВыбраннаяРоль = Метаданные.Роли.Найти(Роль.ИмяРоли);
			ТекущийПользователь.Роли.Добавить(ВыбраннаяРоль);
		КонецЦикла;
		ТекущийПользователь.Записать();		
	КонецЕсли;
КонецПроцедуры
